In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
df["names"] = ["Kayode", "Tochukwu", "Moshood"]
df

      names
0    Kayode
1  Tochukwu
2   Moshood

In [4]:
df["orgs"] = ["Tesla", "World Bank", "Tinubu"]
df

      names        orgs
0    Kayode       Tesla
1  Tochukwu  World Bank
2   Moshood      Tinubu

In [8]:
df["names"] == "Kayode"

0     True
1    False
2    False
Name: names, dtype: bool

In [9]:
df[df["names"] == "Kayode"]

    names   orgs    name
0  Kayode  Tesla  Kayode

In [11]:
df

      names        orgs    name
0    Kayode       Tesla  Kayode
1  Tochukwu  World Bank  Kayode
2   Moshood      Tinubu  Kayode

In [12]:
df.names

0      Kayode
1    Tochukwu
2     Moshood
Name: names, dtype: object

In [16]:
df.names.iloc[0][:3]

'Kay'

In [18]:
for row in df.names.tolist():
    print(row[:3])

Kay
Toc
Mos

In [22]:
#make a dataframe: return
#materials as input from existing variables
#create data

In [53]:
#create a dataframe from a set of python lists
def df_maker():
    orgs = ["Tesla", "World Bank", "Tinubu", "Keen British School"]
    names = ["Kayode", "Tochukwu", "Moshood", "Kamsi"]
    column_one = "names"
    column_two = "orgs"

    dfx = pd.DataFrame()
    dfx[column_one] = names
    dfx[column_two] = orgs
    return dfx

In [32]:
data = df_maker()

In [33]:
data

      names        orgs
0    Kayode       Tesla
1  Tochukwu  World Bank
2   Moshood      Tinubu

In [35]:
type(data)

pandas.core.frame.DataFrame

In [43]:
def parse(data):
    for row in data.itertuples():
        user = row.names
        if user == 'Moshood':
            message = f"{row.names} does not works with {row.orgs}"
        else:
            message = f"{row.names} works with {row.orgs}"
        print(message)

In [46]:
parse(data)

Kayode works with Tesla
Tochukwu works with World Bank
Moshood does not works with Tinubu

In [51]:
def do():
    my_data = df_maker() 
    parse(my_data)
    return "Job done!"

In [54]:
do()

Kayode works with Tesla
Tochukwu works with World Bank
Moshood does not works with Tinubu
Kamsi works with Keen British School

'Job done!'